# Лабораторная работа 1. Знакомство с IaaS, PaaS, SaaS сервисами в облаке на примере Amazon Web Services (AWS). Создание сервисной модели. Вариант 2
## Цель работы: 
Знакомство с облачными сервисами. Понимание уровней абстракции над инфраструктурой в облаке. Формирование понимания типов потребления сервисов в сервисной-модели.

**. Amazon Elastic Compute Cloud (Amazon EC2)** — это веб-сервис, который предоставляет безопасную, масштабируемую вычислительную мощность в облаке 
**. Amazon DynamoDB Accelerator (DAX)** — это полностью управляемый высокодоступный кэш в оперативной памяти для Amazon DynamoDB, который обеспечивает до 10-кратное повышение производительности
**. Amazon DynamoDB** — это доступный облачный бессерверный сервис баз данных. DynamoDB удовлетворяет ваши потребности в масштабировании и преодолении операционных сложностей, связанных с реляционными базами данных.
**. AWSDatabaseMigrationSvc**– это сервис миграции, который помогает быстро, безопасно и с нулевой потерей данных перенести рабочие нагрузки баз данных и аналитики на AWS.
**. AWS Device Farm** – это сервис для тестирования приложений, который повышает производительность мобильных и веб-приложений. Для этого используются различные браузеры для настольных компьютеров и реальные мобильные устройства, поэтому вам не требуется создавать собственную инфраструктуру для тестов. Это ускоряет процесс тестирования, во время которого Device Farm создает журналы для быстрого выявления ошибок в работе вашего приложения.
**. IoTDeviceManagement** - это сервис для надзора и обслуживания подключенных устройств в сети IoT. Сервис включает в себя адаптацию новых устройств, настройку параметров, мониторинг их производительности, обеспечение безопасности, обновление программного обеспечения и утилизацию устройств.
**. APNFee** -
**. Amazon Translate** – это сервис нейронного машинного перевода, обеспечивающий быстрый, высококачественный, доступный по стоимости перевод с пользовательскими настройками с одного языка на другой.
**. Amazon Transcribe** – это сервис автоматического распознавания речи, который позволяет разработчикам добавлять в свои приложения возможности преобразования речи в текст. В его основе лежит базовая речевая модель, которая обеспечивает высокоточную транскрипцию потоковой и записанной речи. 
**. CloudHSM** - это полностью управляемый сервис, который автоматизирует аппаратное обеспечение, исправление программного обеспечения и безопасное управление ключами.
